cask_args appdir: "/Applications"

tap "homebrew/cask"         # macOS GUI applications
tap "buo/cask-upgrade"      # update cask GUI apps

# Install CLI apps
brew "coreutils"          # newer versions of core utilities
brew "eza"                # `ls` / `tree` replacement
brew "gh"                 # github CLI
brew "ghcup"              # Preferred Haskell installer / package manager
brew "git"                # more recent git than Xcode may provide
brew "htop"               # better `top`
brew "imagemagick"        # TUI image processing
brew "mas"                # Mac App Store CLI
brew "micro"              # better terminal editor
brwe "neovim"             # better vim
brew "pre-commit"         # pre-commit hooks
brew "r"                  # R programming language
brew "ripgrep"            # Regex directory searching
brew "ruby"               # up-to-date Ruby programming language
brew "rust"               # Rust programming language
brew "screen"             # terminal multiplexer
brew "speedtest-cli"      # speedtest.net CLI
brew "tldr"               # tldr.io, summarized version of `man`
brew "wget"               # download files from the web
brew "uv"                 # Python dev tools
brew "zellij"             # terminal multiplexer

# Install GUI apps
cask "anki"                         # flashcards
cask "balance-lock"                 # keep bluetooth audio balanced
cask "bartender"                    # arrange menu bar
cask "docker"                       # containers & vms
cask "font-cascadia-code"           # Microsoft's Cascadia Code font
cask "font-cascadia-mono"           # Microsoft's Cascadia Mono font (no ligatures)
cask "font-cochineal"               # Cochineal font (nice serif)
cask "font-computer-modern"         # TeX's Computer Modern font, for non-TeX use
cask "font-ibm-plex-sans"           # IBM Plex font (sans)
cask "font-ibm-plex-sans-condensed  # IBM Plex font (sans)
cask "font-ibm-plex-mono"           # IBM Plex font (mono)
cask "font-ibm-plex-serif"          # IBM Plex font (serif)
cask "font-input"                   # Input font (serif, sans, mono)
cask "font-inter"                   # Inter font (sans)
cask "google-chrome"                # web browser
cask "iterm2"                       # better terminal
cask "mactex"                       # LaTeX distribution
cask "racket"                       # Racket programming language
cask "raycast"                      # macOS launcher
cask "sf-symbols"                   # Apple's SF Symbols App
cask "skim"                         # PDF reader w/ dark mode
cask "spotify"                      # music streaming
cask "visual-studio-code"           # code editor
cask "zed"                          # zed editor
cask "zoom"                         # video conferencing

# Install apps through Mac App Store
mas "about-blank", id: 1239207203              # minimal page blocker for safari
mas "AdGuard for Safari", id: 1440147259       # ad blocker for safari
mas "Affinity Designer 2", id: 1616831348      # vector graphics editor
mas "Affinity Photo 2", id: 1616822987         # photo editor
mas "Affinity Publisher 2", id: 1606941598     # desktop publishing
mas "Broadcasts", id: 1469995354               # internet radio
mas "Dark Reader for Safari", id: 1438243180   # dark mode for safari
mas "Developer", id: 640199958                 # apple developer app
mas "Fantastical", id: 975937182               # calendar app
mas "Final Cut Pro", id: 424389933             # video editor
mas "iA Writer", id: 775737590                 # markdown editor
mas "Keynote", id: 409183694                   # presentation software
mas "Kindle", id: 405399194                    # e-book reader
mas "Logic Pro", id: 634148309                 # audio editor
mas "Magnet", id: 441258766                    # window manager
mas "Messenger", id: 1480068668                # facebook messenger
mas "Microsoft PowerPoint", id: 462062816      # presentation software
mas "Microsoft Word", id: 462054704            # word processor
mas "Numbers", id: 409203825                   # spreadsheet software
mas "Pages", id: 409201541                     # word processor
mas "Slack", id: 803453959                     # team communication
mas "TaskPaper", id: 1090940630                # plain text to-do list
mas "Things", id: 904280696                    # task manager
mas "Velja", id: 1607635845                    # meta-browser for opening links
mas "Space Gremlin", id: 414515628             # see used disk space
